# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [19, 27, 44, 40, 38, 94] # P3/8
  - [96, 68, 86, 152, 180, 137]  # P4/16
  - [140, 301, 303, 264, 238, 542]  # P5/32
  - [436, 615, 739, 380, 925, 792]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args] input 3 channels
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C3, [128]],            # 2
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C3, [256]],            # 4

   [-1, 1, Conv, [512, 3, 2]],    #
   [-1, 9, C3, [512]],            # 6-P4/16

   [-1, 1, Conv, [768, 3, 2]],    # 7-P5/32
   [-1, 3, C3, [768]],            # 8

   [-1, 1, Conv, [1024, 3, 2]],   # 9 -P6/32
   [-1, 3, C3, [1024]],           # 10
   [-1, 1, SPPF, [1024, 5]],      # p11
  ]

# YOLOv5 v6.0 head 3 - P3, P4, P5, P6 at strides 8, 16, 32, 64
head:
  [
   [-1, 1, Conv, [768, 1, 1]],     # 12
   [-1, 1, nn.Upsample, [None, 2, nearest]],
   [[-1, 8], 1, Concat, [1]],      # cat 
   [-1, 3, C3, [768, False]],      # 15

   [-1, 1, Conv, [512, 1, 1]],     # 16
   [-1, 1, nn.Upsample, [None, 2, nearest]],
   [[-1, 6], 1, Concat, [1]],      # cat 
   [-1, 3, C3, [512, False]],      # 19

   [-1, 1, Conv, [256, 1, 1]],     # 20
   [-1, 1, nn.Upsample, [None, 2, nearest]],
   [[-1, 4], 1, Concat, [1]],      # 22
   [-1, 3, C3, [256, False]],      # 23 (P3/8-large)

   [-1, 1, Conv, [256, 3, 2]],     # 24
   [[-1, 20], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],      # 26 #(P4/16-large)

   [-1, 1, Conv, [512, 3, 2]],     # 27
   [[-1, 16], 1, Concat, [1]],     # #28 cat backbone P6
   [-1, 3, C3, [768, False]],      # 29 (P5/32-large)

   [-1, 1, Conv, [768, 3, 2]],     # 30
   [[-1, 12], 1, Concat, [1]],     # 31 # cat backbone P7
   [-1, 3, C3, [1024, False]],     # 32  (P6/64-large)


   [[23, 26, 29, 32], 1, Detect, [nc, anchors]] # 33 Detect(P3, P4, P5, p6)

  ]


